hNam2004/m-y-gi-t-s-y/Code/Esp32/src/main.cpp
    int expectedLength = FC03_FULL_RESPONSE_LENGTH;

    while (millis() - startTime < 1000)
    {
        if (Serial.available())
        {
            if (bytesRead < RESPONSE_BUFFER_SIZE)
            {
                responseBuffer[bytesRead++] = Serial.read();
            }
            else
            {
                while (Serial.available())
                    Serial.read();
                break;
            }
        }
        if (bytesRead == expectedLength)
        {
            break;
        }
    }

    if (bytesRead == expectedLength)
    {
        return parseResponse(responseBuffer, bytesRead);
    }

    machineInfo.isValid = false;
    return false;
}

// --- [UPDATE] THÊM TOPIC OTA VÀO HÀM NÀY ---
void buildMqttTopics()
{
    sprintf(mqtt_topic_info, "Kdev/%s/info", deviceID);
    sprintf(mqtt_topic_cmd, "Kdev/%s/cmd", deviceID);
    sprintf(mqtt_topic_status, "Kdev/%s/status", deviceID);
    sprintf(mqtt_topic_control, "Kdev/%s/control", deviceID);
    
    // Tạo topic riêng: Kdev/{ID}/ota_status
    sprintf(mqtt_topic_ota_status, "Kdev/%s/ota_status", deviceID);

    Serial.println("--- MQTT Topics Đã Xây Dựng ---");
    Serial.printf("Info: %s\n", mqtt_topic_info);
    Serial.printf("OTA Status: %s\n", mqtt_topic_ota_status);
    Serial.println("-------------------------------");
}

void saveAndRestart(const char* key, String value)
{
    saveConfigDataToEEPROM(key, value.c_str());

    Serial.printf("Đã lưu %s = %s vào EEPROM\n", key, value.c_str());
    Serial.println("Khởi động lại sau 2 giây...");
    vTaskDelay(pdMS_TO_TICKS(2000));
    ESP.restart();
}

void loadConfig()
{
    readConfigDataFromEEPROM(); 
    
    String id = String(sys_eeprom_deviceID);
    String server = String(sys_eeprom_mqttServer);
    String typeStr = String(sys_eeprom_machineType);
    
    if (id.length() == 0) {
        id = "1234";
    }
    if (server.length() == 0) {
        server = "devices.koisolutions.vn";
    }
    if (typeStr.length() == 0) {
        typeStr = "1";
    }
    
    machineType = typeStr.toInt(); 
    if (machineType != 1 && machineType != 2)
    {
        machineType = 1; 
    }
    
    strcpy(deviceID, id.c_str());
    strcpy(mqttServer, server.c_str());

    Serial.println("--- Cấu Hình Đã Tải (từ EEPROM) ---");
    Serial.printf("Device ID: %s\n", deviceID);
    Serial.printf("MQTT Server: %s\n", mqttServer);
    Serial.printf("Machine Type: %d (%s)\n", machineType, (machineType == 1) ? "Modbus" : "Coin Pin");
    Serial.println("-------------------------");

    buildMqttTopics();
}

int MQTT_Publish_Status(const char* _t, const char* _s) {
    StaticJsonDocument<128> doc;
    if (_t != "null") doc["t"] = _t;
    if (_s != "null") doc["v"] = _s;
    
    char strPub[128];
    size_t len = serializeJson(doc, strPub, sizeof(strPub));
    
    if (client.connected()) {
        client.publish(mqtt_topic_cmd, strPub, len); 
        return 1;
    } else {
        return 0;
    }
}

// --- [GIỮ LẠI] HÀM IN PHẦN TRĂM ĐỂ DEBUG (SERIAL) ---
void printPercent(uint32_t readLength, uint32_t contentLength) {
    if (contentLength != 0) {
        Serial.print("\r [OTA] ");
        Serial.print((100.0 * readLength) / contentLength);
        Serial.print('%');
    } else {
        Serial.println(readLength);
    }
}

// --- [UPDATE] HÀM DOWNLOAD TỐI ƯU (BUFFER) ---
int downloadFirmWare(String server, String resource)
{
    const char* firmware_filename = "/firmware.bin"; 

    if (SPIFFS.exists(firmware_filename)) {
        SPIFFS.remove(firmware_filename);
        Serial.println("[OTA] Đã xóa tệp firmware cũ.");
    }

    HTTPClient http;
    WiFiClientSecure client_for_http;
    client_for_http.setInsecure();

    String full_url = "https://" + server + "/" + resource;
    Serial.print(F("[OTA] Đang kết nối: "));
    Serial.println(full_url);

    if (!http.begin(client_for_http, full_url)) {
        Serial.println("[OTA] Lỗi khởi tạo HTTPClient.");
        return 0;
    }

    http.addHeader("User-Agent", "ESP32-OTA-Downloader");
    http.setTimeout(10000); 
    http.setFollowRedirects(HTTPC_STRICT_FOLLOW_REDIRECTS);
    
    int httpCode = http.GET();

    if (httpCode != HTTP_CODE_OK) { 
        Serial.printf("[OTA] HTTP GET thất bại: %d\n", httpCode);
        http.end();
        return 0;
    }

    int contentLength = http.getSize();
    Serial.printf("[OTA] Kích thước file: %d bytes\n", contentLength);

    File file = SPIFFS.open(firmware_filename, FILE_WRITE);
    if (!file) {
        Serial.println(F("[OTA] Lỗi mở file SPIFFS"));
        http.end();
        return 0;
    }

    WiFiClient* stream = http.getStreamPtr();

    // --- BẮT ĐẦU ĐOẠN TỐI ƯU BUFFER ---
    uint32_t readLength = 0;
    CRC32 crc;
    unsigned long timeout = millis();
    unsigned long lastUpdate = millis();
    
    // Buffer 2KB
    uint8_t buff[2048] = { 0 };
    
    printPercent(readLength, contentLength);

    while (http.connected() && (readLength < contentLength || contentLength == -1))
    {
        if (millis() - timeout > 10000L) {
            Serial.println("\n[OTA] Lỗi: Timeout khi tải dữ liệu!");
            break;
        }

        size_t size = stream->available();
        if (size > 0) 
        {
            // Đọc khối lớn
            int c = stream->readBytes(buff, ((size > sizeof(buff)) ? sizeof(buff) : size));
            
            // Ghi khối lớn
            file.write(buff, c);
            
            for(int i=0; i<c; i++) {
                crc.update(buff[i]);
            }
            
            readLength += c;
            timeout = millis();

            if (millis() - lastUpdate > 200) {
                printPercent(readLength, contentLength);
                lastUpdate = millis();
            }
        }
        else {
             vTaskDelay(pdMS_TO_TICKS(1)); 
        }
    }

    file.close();
    http.end(); 
    
    Serial.println(); 
    Serial.print("[OTA] Tải xong. CRC32: 0x"); Serial.println(crc.finalize(), HEX);

    if (readLength != contentLength && contentLength != -1) {
        Serial.printf("[OTA] Lỗi: Chỉ tải được %d / %d bytes\n", readLength, contentLength);
        return 0;
    }

    Serial.println(F("[OTA] Tải tệp thành công."));
    return 1;
}

int updateFirmWare() {
    const char* firmware_filename = "/firmware.bin";

    File file = SPIFFS.open(firmware_filename);
    if (!file) {
        Serial.println("[OTA] Không thể mở tệp /firmware.bin");
        return 0;
    }

    size_t fileSize = file.size();
    if (fileSize == 0) {
        Serial.println("[OTA] Lỗi: Tệp firmware rỗng.");
        file.close();
        return 0;
    }

    Serial.println("[OTA] Bắt đầu quá trình cập nhật...");

    if (!Update.begin(fileSize)) {
        Serial.println("[OTA] Không đủ dung lượng để cập nhật");
        file.close();
        return 0;
    };

