hNam2004/m-y-gi-t-s-y/Code/Esp32/src/main.cpp
                vTaskDelay(pdMS_TO_TICKS(200)); 
                
                while (Serial.available()) Serial.read();
                bool infoReadSuccess = readAndParseMachineData();

                JsonDocument doc_s; 
                doc_s["s"] = (currentStatus == 1) ? 1 : 0;
                if (digitalRead(IN_SIG2)){
                    doc_s["s"] = 1;
                }
                if (infoReadSuccess)
                {
                    char v_buffer[100];
                    sprintf(v_buffer, "%d,0,%d,0", machineInfo.temperature,machineInfo.coinsInBox);
                    doc_s["v"] = v_buffer;
                    doc_s["st"] = 0; 
                
                }
                else
                {
                    doc_s["v"] = "0,0,0,0";
                    doc_s["st"] = "02";
                }
                
                if (machineType == 2){ 
                    doc_s["st"] = "0";
                }
                char jsonBuffer[256];
                serializeJson(doc_s, jsonBuffer);
                client.publish(mqtt_topic_info, jsonBuffer); 
                digitalWrite(LED_PIN, LOW);
                vTaskDelay(pdMS_TO_TICKS(100));
                digitalWrite(LED_PIN,HIGH);
            }
            else if (strcmp(t_value, "i") == 0 && strcmp(v_value, "1") == 0)
            {
                char jsonMsg[50];
                sprintf(jsonMsg, "{\"t\":\"%s\", \"v\":\"%s\"}", t_value, v_value);
                client.publish(mqtt_topic_cmd, jsonMsg); 
                client.publish(mqtt_topic_info, FIRMWARE_VERSION);
            }

            // --- LOGIC OTA ---
            else if (strcmp(t_value, "f_update") == 0)
            {
                if (g_otaInProgress) 
                {
                    Serial.println("[OTA] Đang bận cập nhật (Task 6 đang chạy), từ chối lệnh!");
                    MQTT_Publish_Status("f_update", "busy_ota");
                }
                else
                {
                    Serial.println("[OTA] Nhận lệnh cập nhật. Kích hoạt Task 6...");

                    g_otaInProgress = true; 

                    strncpy(g_otaUrl, v_value, sizeof(g_otaUrl) - 1);
                    g_otaUrl[sizeof(g_otaUrl) - 1] = '\0'; 

                    // Phản hồi vào topic CMD như cũ (để giữ tương thích logic cũ nếu cần)
                    MQTT_Publish_Status("f_update", "starting");
                    
                    if (task6_handle != NULL) {
                        vTaskResume(task6_handle);
                    } else {
                        Serial.println("[OTA] LỖI NGHIÊM TRỌNG: task6_handle is NULL!");
                        g_otaInProgress = false; 
                    }
                }
            }
            else
            {
                Serial.printf("Invalid command type 't': %s\n", t_value);
            }
        }
        else
        {
            Serial.println("Invalid JSON format in control topic");
        }
    }
}



void bootInterruptHandler()
{
    Serial.println("Interupt ocur");
    Interupt_Flag = 1;
}

void task1Function(void *parameter)
{
    while (true)
    {
        sys_capserver_proc();
        
        vTaskDelay(pdMS_TO_TICKS(1));
    }
    Serial.print(wifiState);
}

void task2Function(void *parameter)
{
    pinMode(LED_PIN, OUTPUT);
    long lastPingTime = 0;
    const int pingInterval = 90000;

    while (true)
    {
        switch (wifiState)
        {
        case WIFI_CONNECTED:
            if (!connectWifiPing)
            {
                digitalWrite(LED_PIN, HIGH);
                vTaskDelay(pdMS_TO_TICKS(300));
                digitalWrite(LED_PIN, LOW);
                vTaskDelay(pdMS_TO_TICKS(300));
                digitalWrite(LED_PIN, HIGH);
                connectWifiPing = true;
            }
            if (millis() - lastPingTime > pingInterval)
            {
                if (!Ping.ping("www.google.com", 1))
                {
                    wifiState = WIFI_CONFIGURED_NOT_CONNECTED;
                }
                lastPingTime = millis();
            }
            vTaskDelay(pdMS_TO_TICKS(100));
            break;
        case WIFI_CONFIGURED_NOT_CONNECTED:
            digitalWrite(LED_PIN, !digitalRead(LED_PIN));
            vTaskDelay(pdMS_TO_TICKS(1000));
            break;
        case WIFI_NOT_CONFIGURED:
            digitalWrite(LED_PIN, LOW);
            vTaskDelay(pdMS_TO_TICKS(200));
            connectWifiPing = false;
            break;
        }
    }
}

void task3Function(void *parameter)
{
    unsigned long task3_lastBlinkTime = 0;
    const int BLINK_INTERVAL = 150; 
    const int RESET_HOLD_TIME = 5000; 

    while (true)
    {
        if (digitalRead(RST_PIN) == LOW) 
        {
            if (!press)
            {
                press = true; 
                pressTime = millis(); 
                task3_lastBlinkTime = millis(); 
                Serial.println("[Task 3] Bắt đầu giữ nút RST (timer 5s)...");
            }

            if (press && (millis() - pressTime >= RESET_HOLD_TIME))
            {
                Serial.println("[Task 3] >>> Nut RST giu 5s, xoa WiFi <<<");
                clearWiFiCredentials(); 
                press = false; 
                digitalWrite(LED_PIN,HIGH);
                vTaskDelay(pdMS_TO_TICKS(100));
                digitalWrite(LED_PIN,LOW);
            }
        }
        else 
        {
            if (press)
            {
                Serial.println("[Task 3] Đã thả nút RST (trước 5s).");
                digitalWrite(LED_PIN, HIGH); 
            }
            press = false; 
        }

        vTaskDelay(pdMS_TO_TICKS(50));
    }
}


void task5Function(void *parameter)
{
    long lastMsgTime = 0;
    const int publishInterval = 3000;
    long lastMqttAttempt = 0;
    long lastWifiReconnectAttempt = 0;
    const int wifiReconnectInterval = 15000;

    while (true)
    {
        checkSerialCommands(); 
        
        if (WiFi.status() == WL_CONNECTED)
        {
            if (wifiState != WIFI_CONNECTED)
            {
                wifiState = WIFI_CONNECTED;
            }
            
            if (!client.connected())
            {
                if (millis() - lastMqttAttempt > 5000)
                {
                    Serial.print("Attempting MQTT connection...");
                    if (client.connect(deviceID))
                    {
                        Serial.println("MQTT connected");
                        client.subscribe(mqtt_topic_control);
                        client.subscribe(mqtt_topic_info); 
                    }
                    else
                    {
                        Serial.printf("failed, rc=%d\n", client.state());
                    }
                    lastMqttAttempt = millis();
                }
            }
            else 
            {
                client.loop(); 
                
