hNam2004/m-y-gi-t-s-y/Code/Esp32/src/main.cpp
                if (millis() - lastMsgTime > publishInterval)
                {
                    if (!g_otaInProgress) 
                    {
                        lastMsgTime = millis();

                        while (Serial.available())
                            Serial.read();

                        int currentStatus = getMachineStatus();

                        while (Serial.available())
                            Serial.read();

                        bool infoReadSuccess = readAndParseMachineData();

                        JsonDocument doc_pub; 
                        doc_pub["s"] = (currentStatus == 1) ? 1 : 0;
                        if (digitalRead(IN_SIG2)){
                            doc_pub["s"] = 1;
                        }
                        if (infoReadSuccess)
                        {
                            char v_buffer[100];
                            sprintf(v_buffer, "%d,0,%d,0", machineInfo.temperature,machineInfo.coinsInBox);
                            doc_pub["v"] = v_buffer;
                            doc_pub["st"] = 0; 
                        }
                        else
                        {
                            doc_pub["v"] = "0,0,0,0";
                            doc_pub["st"] = "02";
                        }
                        
                        if (machineType == 2){ 
                            doc_pub["st"] = "0";
                        }
                        char jsonBuffer[256];
                        serializeJson(doc_pub, jsonBuffer);
                        client.publish(mqtt_topic_info, jsonBuffer);
                        digitalWrite(LED_PIN, LOW);
                        vTaskDelay(pdMS_TO_TICKS(100));
                        digitalWrite(LED_PIN,HIGH);
                        
                        Serial.print("Published info: ");
                        Serial.println(jsonBuffer);
                    }
                    else {
                        Serial.println("[Task 5] Đang OTA, tạm dừng Modbus...");
                        lastMsgTime = millis(); 
                    }
                }
            }
        }
        else if (wifiState == WIFI_CONFIGURED_NOT_CONNECTED)
        {
            if (millis() - lastWifiReconnectAttempt > wifiReconnectInterval)
            {
                Serial.println("[Task 5] WiFi lost. Attempting to reconnect...");
                WiFi.reconnect();
                lastWifiReconnectAttempt = millis();
            }
        }
        vTaskDelay(pdMS_TO_TICKS(20));
    }
}


// --- [UPDATE] TASK 6: OTA VỚI THÔNG BÁO TRẠNG THÁI ---
void task6Function(void *parameter)
{
    Serial.println("[Task 6] Khởi tạo. Sẵn sàng nhận lệnh OTA.");

    while (true)
    {
        vTaskSuspend(NULL);

        // --- BẮT ĐẦU OTA ---
        Serial.println("[Task 6] Đã được kích hoạt. Bắt đầu quá trình OTA...");
        
        // [NEW] Gửi thông báo: Đang bắt đầu
        client.publish(mqtt_topic_ota_status, "starting");
        
        String cmd_firmware = String(g_otaUrl); 
        String _Data[2]; 

        int firstSlash = cmd_firmware.indexOf('/');
        if (firstSlash == -1 || firstSlash == 0) {
            Serial.println("[Task 6] Lỗi: Định dạng 'v' sai.");
            // [NEW] Gửi thông báo: Lỗi định dạng
            client.publish(mqtt_topic_ota_status, "failed_format");
            g_otaInProgress = false; 
            continue; 
        }

        _Data[0] = cmd_firmware.substring(0, firstSlash);
        _Data[1] = cmd_firmware.substring(firstSlash + 1);

        Serial.println("   [Task 6] Server: " + _Data[0]);
        Serial.println("   [Task 6] Resource: " + _Data[1]);
        
        int ret;
        
        // BƯỚC 3: DOWNLOAD
        ret = downloadFirmWare(_Data[0], _Data[1]);
        
        if (ret == 0) 
        {
            Serial.println("[Task 6] Tải firmware thất bại.");
            // [NEW] Gửi thông báo: Lỗi tải về
            client.publish(mqtt_topic_ota_status, "failed_download");
            g_otaInProgress = false; 
            continue; 
        }
        
        // BƯỚC 4: UPDATE
        ret = updateFirmWare();
        
        if (ret == 1) 
        {
            Serial.println("[Task 6] Cập nhật thành công. Khởi động lại...");
            // [NEW] Gửi thông báo: Thành công!
            client.publish(mqtt_topic_ota_status, "success");
            vTaskDelay(pdMS_TO_TICKS(1000));
            ESP.restart(); 
        }
        else 
        {
            Serial.println("[Task 6] Cài đặt firmware thất bại.");
            // [NEW] Gửi thông báo: Lỗi cập nhật
            client.publish(mqtt_topic_ota_status, "failed_update");
            g_otaInProgress = false; 
            continue; 
        }
    }
}


void setup()
{
    Serial.begin(9600, SERIAL_8N1);
    delay(1000);

    if(!SPIFFS.begin(true)){
        Serial.println("An Error has occurred while mounting SPIFFS");
        return; 
    }
    Serial.println("SPIFFS mounted successfully");
    
    EEPROM.begin(512); 
    
    loadConfig(); 
    sys_wifi_init(); 
    sys_capserver_init();
    pinMode(BOOT_PIN, INPUT_PULLUP);
    pinMode(RST_PIN, INPUT_PULLUP);
    pinMode(IN_SIG2, INPUT_PULLDOWN);
    pinMode(LED_PIN, OUTPUT);
    pinMode(COIN_PIN, OUTPUT);
    client.setServer(mqttServer, mqtt_port);
    client.setCallback(mqttCallback);

    xTaskCreate(task1Function, "Task 1", 10000, NULL, 1, NULL); 
    xTaskCreate(task2Function, "Task 2", 10000, NULL, 1, NULL); 
    xTaskCreate(task3Function, "Task 3", 3000, NULL, 1, NULL); 
    xTaskCreate(task5Function, "Task 5", 10000, NULL, 1, NULL); 

    // Task 6 (OTA) cần stack lớn
    xTaskCreate(task6Function, "Task 6 OTA", 8192, NULL, 2, &task6_handle); 

    if (task6_handle == NULL) {
        Serial.println("LỖI: Không thể tạo Task 6!");
    }
}

void loop()
{
}